org/wiki/linux-system-configuration-general.org
#+STARTUP: showall
#+STARTUP: hidestars
#+OPTIONS: H:2 num:nil tags:nil toc:nil timestamps:t
#+TYPE: wiki
#+LAYOUT: post
#+AUTHOR: carltonf
#+DATE: 2015-07-17 Fri 15:58
#+TITLE: Linux System Configuration General
#+DESCRIPTION: The all-in-one list of tricks (should be splitted into multiple entries) 
#+TAGS: 
#+CATEGORIES: linux,configuration

* desktop environment
** keyboard oriented settings
it's highly recommended to use *ratpoison* or *stumpwm*. However, the following
should work on any desktop environment (e.g. Gnome and KDE)
*** tools used
- xwrits - reminds you to take wrist breaks
  well, in case you don't have *workrave* or *RSIBreak*
- xbindkeys - a grabbing keys program for X
  can be used to define combination keys that simulate behaviors of *ratpoison*
- dmenu - dynamic menu (includes dmenu_run, and dmenu_path)
  open program through keystrokes
- xmodmap - utility for modifying keymaps and pointer button mappings in X
  emacs key (make enter and cap ctrls)
*** configurations
NOTE: GNU Guile is required to configure xbindkeys

[[../core/2e/fd/keyoriented][keyoriented]]

** sharing files through bluetooth
- In GNOME 3 (< 3.6)
  use this command =gnome-file-share-properties= to configure file sharing
  settings. (Or with Gnome shell, you can search it in Activities overview.)

- Above GNOME 3.6
  
  The above mentioned tool has been removed from =gnome-user-share= package, and
  the related dconf keys have also been changed. Some sharing properties can be
  set in G-C-C now but some functionality seems to be missing.

* applications
** vmware
*** VMware 7.1.4(5) on Ubuntu 11.10
fix module compilation errors
- within the following directory, usually run scripts within
  'vmware2_6_39patchv3.tar.bz2' is enough
- other web pages serve as references.

references & patches: [[../core/92/9c/vmware-7-ubuntu11.10-patch][vmware-7-ubuntu11.10-patch.dir]]

* ubuntu
** offline repo
all related files are in [[../core/b1/34/offline_ubuntu_repo][offline_ubuntu_repo]]
*** preparation
1. define an offline repo location
   add it to the top of the source list
   ~deb file:///opt/ubuntu_offline_repo/ oneiric main restricted multiverse universe~
2. populate the above directory
   - the key here is to simulate the file system hierarchy of an ubuntu mirror
   - download files with 'init_setup.bat'
   - copy to corresponding directory in the local repo
   - apt-get update
3. the local repo is ready to be used, searched and generate dependencies.
*** how to use
1. copy files in *in_linux* to the local repo (or other places e.g. /root/)
2. you can accumulate the package to install to a separate file. (find them through apt-cache search)
   the 'todo.txt' is and example
3. run *./gen_list.sh* to generate *apt_list* (see *./gen_list.sh* to see usage)
4. copy *apt_list* to pen disk to windows box with Internet
5. run ~wget.exe -i apt_list~ to download
6. copy all *deb* files downloaded to ~/var/cache/apt/archives/~
7. ~apt-get install <packages>~
* shell commands
** remove some files but not all
*** shell pattern (glob and extglob)
- basic glob
  ?: one char; *: any number of chars; [..]: one of the char

  highly limited, trying to figure out the right pattern might be even harder
  and more time consuming than the toolchain method
- extglob
  shopt -s extglob

  !(.|.|.) anything that doesn't match patterns

*** toolchain
one example: ls | grep ... | xargs rm

** urxvt
The following command, combined with =new-session= in =~/.tmux.conf=, let you connect to
an existent session or create a new one if no session is alive.

=urxvt -title "urxvt-tmux" -e tmux attach-session &=
** rsync
# linux to linux
#+BEGIN_SRC shell-script
  rsync -avuz --exclude=.repo/ --exclude=.git/ `pwd` dev-tplink:
  rsync -avuz dev-tplink:/home/xiongchao/gingerbread_u12/out .

  # to windows: pay attention to the last slash of the 1st param.
  rsync --delete -vuzr carlibrelib ~/mnt/syncdisk
#+END_SRC
* ssh
** sshfs
[[../core/77/b9/sshfs_intro][sshfs_intro]]
** speed/multiplex up ssh connection
articles: [[../core/89/3a/ssh_connection_multiplexing][ssh_connection_multiplexing]]
*** ssh -N -f host

opens a connection and goes into the background without executing a remote
command so you don't need to keep a window or shell running locally just to keep
that connection.
*** opinions
Also, isn't the whole point of putting ControlPath in =.ssh/config= to make the
=-S= argument uneccessary? And doesn't the =ControlMaster auto= also make the
toggling =-M= uneccessary?
*** auto vs autoask
You can set it to autoask instead of auto to have ssh prompt you for whether or
not to reuse an existing connection.
*** ControlPath
The configuration directive ControlPath tells ssh where it should keep its
socket information. I've chosen to put these files in /tmp, however it may be
best to put this into your own home directory on multi-user systems.
*** -o ControlMaster=no for ssh tunneling
NOTE: You will need to specify -o ControlMaster=no when using ssh to do ssh
tunneling otherwise multiple tunnels to a particular host will not work.

*** X11 forwarding under connection multiplexing

Won't work and will fail silently, use =-v= to see whether X11 forwarding
request is sent to debug this.

- config solution

  : add ForwardX11=yes (and ForwardX11Trusted=yes) to .ssh/config

- =-S none= option
  
  The last time I checked this one, it's not working, however it should
  according to ssh man page.
  
  PS: while testing this one, I crashed =systemd= in SLED12 beta2, which
  resulted in very interesting bug.

* diff + patch
