_wiki/2015-07-17-linux-system-configuration-general.html
---
collections: wiki
layout: post
title: Linux System Configuration General
date: 2015-07-17
categories: 
- linux
- configuration
tags: 
-
author: carltonf
excerpt: The all-in-one list of tricks (should be splitted into multiple entries) 
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">desktop environment</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">keyboard oriented settings</h3>
<div class="outline-text-3" id="text-1-1">
<p>
it's highly recommended to use <b>ratpoison</b> or <b>stumpwm</b>. However, the following
should work on any desktop environment (e.g. Gnome and KDE)
</p>
</div>
<ul class="org-ul"><li><a id="sec-1-1-1" name="sec-1-1-1"></a>tools used<br  /><div class="outline-text-4" id="text-1-1-1">
<ul class="org-ul">
<li>xwrits - reminds you to take wrist breaks
well, in case you don't have <b>workrave</b> or <b>RSIBreak</b>
</li>
<li>xbindkeys - a grabbing keys program for X
can be used to define combination keys that simulate behaviors of <b>ratpoison</b>
</li>
<li>dmenu - dynamic menu (includes dmenu<sub>run</sub>, and dmenu<sub>path</sub>)
open program through keystrokes
</li>
<li>xmodmap - utility for modifying keymaps and pointer button mappings in X
emacs key (make enter and cap ctrls)
</li>
</ul>
</div>
</li>
<li><a id="sec-1-1-2" name="sec-1-1-2"></a>configurations<br  /><div class="outline-text-4" id="text-1-1-2">
<p>
NOTE: GNU Guile is required to configure xbindkeys
</p>

<p>
<a href="../core/2e/fd/keyoriented">keyoriented</a>
</p>
</div>
</li></ul>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">sharing files through bluetooth</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>In GNOME 3 (&lt; 3.6)
use this command <code>gnome-file-share-properties</code> to configure file sharing
settings. (Or with Gnome shell, you can search it in Activities overview.)
</li>

<li>Above GNOME 3.6

<p>
The above mentioned tool has been removed from <code>gnome-user-share</code> package, and
the related dconf keys have also been changed. Some sharing properties can be
set in G-C-C now but some functionality seems to be missing.
</p>
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">applications</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">vmware</h3>
<div class="outline-text-3" id="text-2-1">
</div><ul class="org-ul"><li><a id="sec-2-1-1" name="sec-2-1-1"></a>VMware 7.1.4(5) on Ubuntu 11.10<br  /><div class="outline-text-4" id="text-2-1-1">
<p>
fix module compilation errors
</p>
<ul class="org-ul">
<li>within the following directory, usually run scripts within
'vmware2<sub>6</sub><sub>39patchv3</sub>.tar.bz2' is enough
</li>
<li>other web pages serve as references.
</li>
</ul>

<p>
references &amp; patches: <a href="../core/92/9c/vmware-7-ubuntu11.10-patch">vmware-7-ubuntu11.10-patch.dir</a>
</p>
</div>
</li></ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">ubuntu</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1">offline repo</h3>
<div class="outline-text-3" id="text-3-1">
<p>
all related files are in <a href="../core/b1/34/offline_ubuntu_repo">offline<sub>ubuntu</sub><sub>repo</sub></a>
</p>
</div>
<ul class="org-ul"><li><a id="sec-3-1-1" name="sec-3-1-1"></a>preparation<br  /><div class="outline-text-4" id="text-3-1-1">
<ol class="org-ol">
<li>define an offline repo location
add it to the top of the source list
<code>deb file:///opt/ubuntu_offline_repo/ oneiric main restricted multiverse universe</code>
</li>
<li>populate the above directory
<ul class="org-ul">
<li>the key here is to simulate the file system hierarchy of an ubuntu mirror
</li>
<li>download files with 'init<sub>setup</sub>.bat'
</li>
<li>copy to corresponding directory in the local repo
</li>
<li>apt-get update
</li>
</ul>
</li>
<li>the local repo is ready to be used, searched and generate dependencies.
</li>
</ol>
</div>
</li>
<li><a id="sec-3-1-2" name="sec-3-1-2"></a>how to use<br  /><div class="outline-text-4" id="text-3-1-2">
<ol class="org-ol">
<li>copy files in <b>in<sub>linux</sub></b> to the local repo (or other places e.g. <i>root</i>)
</li>
<li>you can accumulate the package to install to a separate file. (find them through apt-cache search)
the 'todo.txt' is and example
</li>
<li>run <b>./gen<sub>list</sub>.sh</b> to generate <b>apt<sub>list</sub></b> (see <b>./gen<sub>list</sub>.sh</b> to see usage)
</li>
<li>copy <b>apt<sub>list</sub></b> to pen disk to windows box with Internet
</li>
<li>run <code>wget.exe -i apt_list</code> to download
</li>
<li>copy all <b>deb</b> files downloaded to <code>/var/cache/apt/archives/</code>
</li>
<li><code>apt-get install &lt;packages&gt;</code>
</li>
</ol>
</div>
</li></ul>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">shell commands</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1">remove some files but not all</h3>
<div class="outline-text-3" id="text-4-1">
</div><ul class="org-ul"><li><a id="sec-4-1-1" name="sec-4-1-1"></a>shell pattern (glob and extglob)<br  /><div class="outline-text-4" id="text-4-1-1">
<ul class="org-ul">
<li>basic glob
?: one char; *: any number of chars; [..]: one of the char

<p>
highly limited, trying to figure out the right pattern might be even harder
and more time consuming than the toolchain method
</p>
</li>
<li>extglob
shopt -s extglob

<p>
!(.|.|.) anything that doesn't match patterns
</p>
</li>
</ul>
</div>
</li>

<li><a id="sec-4-1-2" name="sec-4-1-2"></a>toolchain<br  /><div class="outline-text-4" id="text-4-1-2">
<p>
one example: ls | grep &#x2026; | xargs rm
</p>
</div>
</li></ul>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2">urxvt</h3>
<div class="outline-text-3" id="text-4-2">
<p>
The following command, combined with <code>new-session</code> in <code>~/.tmux.conf</code>, let you connect to
an existent session or create a new one if no session is alive.
</p>

<p>
<code>urxvt -title "urxvt-tmux" -e tmux attach-session &amp;</code>
</p>
</div>
</div>
<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3">rsync</h3>
<div class="outline-text-3" id="text-4-3">
<div class="org-src-container">

<pre class="src src-shell-script">rsync -avuz --exclude=.repo/ --exclude=.git/ `pwd` dev-tplink:
rsync -avuz dev-tplink:/home/xiongchao/gingerbread_u12/out .

# to windows: pay attention to the last slash of the 1st param.
rsync --delete -vuzr carlibrelib ~/mnt/syncdisk
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">ssh</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1">sshfs</h3>
<div class="outline-text-3" id="text-5-1">
<p>
<a href="../core/77/b9/sshfs_intro">sshfs<sub>intro</sub></a>
</p>
</div>
</div>
<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2">speed/multiplex up ssh connection</h3>
<div class="outline-text-3" id="text-5-2">
<p>
articles: <a href="../core/89/3a/ssh_connection_multiplexing">ssh<sub>connection</sub><sub>multiplexing</sub></a>
</p>
</div>
<ul class="org-ul"><li><a id="sec-5-2-1" name="sec-5-2-1"></a>ssh -N -f host<br  /><div class="outline-text-4" id="text-5-2-1">
<p>
opens a connection and goes into the background without executing a remote
command so you don't need to keep a window or shell running locally just to keep
that connection.
</p>
</div>
</li>
<li><a id="sec-5-2-2" name="sec-5-2-2"></a>opinions<br  /><div class="outline-text-4" id="text-5-2-2">
<p>
Also, isn't the whole point of putting ControlPath in <code>.ssh/config</code> to make the
<code>-S</code> argument uneccessary? And doesn't the <code>ControlMaster auto</code> also make the
toggling <code>-M</code> uneccessary?
</p>
</div>
</li>
<li><a id="sec-5-2-3" name="sec-5-2-3"></a>auto vs autoask<br  /><div class="outline-text-4" id="text-5-2-3">
<p>
You can set it to autoask instead of auto to have ssh prompt you for whether or
not to reuse an existing connection.
</p>
</div>
</li>
<li><a id="sec-5-2-4" name="sec-5-2-4"></a>ControlPath<br  /><div class="outline-text-4" id="text-5-2-4">
<p>
The configuration directive ControlPath tells ssh where it should keep its
socket information. I've chosen to put these files in /tmp, however it may be
best to put this into your own home directory on multi-user systems.
</p>
</div>
</li>
<li><a id="sec-5-2-5" name="sec-5-2-5"></a>-o ControlMaster=no for ssh tunneling<br  /><div class="outline-text-4" id="text-5-2-5">
<p>
NOTE: You will need to specify -o ControlMaster=no when using ssh to do ssh
tunneling otherwise multiple tunnels to a particular host will not work.
</p>
</div>
</li>

<li><a id="sec-5-2-6" name="sec-5-2-6"></a>X11 forwarding under connection multiplexing<br  /><div class="outline-text-4" id="text-5-2-6">
<p>
Won't work and will fail silently, use <code>-v</code> to see whether X11 forwarding
request is sent to debug this.
</p>

<ul class="org-ul">
<li>config solution

<pre class="example">
add ForwardX11=yes (and ForwardX11Trusted=yes) to .ssh/config
</pre>
</li>

<li><code>-S none</code> option

<p>
The last time I checked this one, it's not working, however it should
according to ssh man page.
</p>

<p>
PS: while testing this one, I crashed <code>systemd</code> in SLED12 beta2, which
resulted in very interesting bug.
</p>
</li>
</ul>
</div>
</li></ul>
</div>
</div>
