org/wiki/linux-system-configuration-general.org
** two files both added some lines, but no change among common lines
example:

=diff -Naur index/ ~/icwiki/index/ > icwiki-patch.diff=

=patch -Rp0 --merge < ~/learnspace/git-mylife/icwiki/icwiki-patch.diff=

NOTE: you can --dry-run for previous command to see what the effect might be,
however, you are still encouraged to backup your to-be-patched files.
* mount virtual disk
original reference: [[../core/7f/37/How to mount a VirtualBox VDI image | Be the signal.maff][How to mount a VirtualBox VDI image | Be the signal]]

The following the essential steps needed
#+BEGIN_SRC shell-script
  # you need to be root
  ## max_part is needed, as sometimes it defaults to 0
  modprobe nbd max_part=16

  # nbd0 is established by last cmd
  qemu-nbd -c /dev/nbd0 .VirtualBox/Machines/win_xp/LargeData.vdi

  mount /dev/mbd0p1 /mnt/tmp
#+END_SRC
* Multiple Pipes
** Common Grep Buffer Issue
use =--line-buffered=, a GNU grep extension.

- example
  =adb shell 'getevent /dev/input/event4' | grep --line-buffered "0003 0019" | tee tmp.txt=

** Other Stdout Buffer Issue
use complex while-read-line structure.

- example
  =tail -f logfile | while read line ; do echo "$line"| grep 'org.springframework'|cut -c 25- ; done=

* Timestamp output
usually we want to timestamp the output, use Perl to do this.

*NOTE*: you may need to deal with buffer issues, refer to [[Multiple Pipes]].
- example
  The following timestamp the distance sensor's output.

  #+BEGIN_SRC shell-script
    # This this the one line perl to timestamp the output.
    # You can change `time' to `localtime', if you want pretty time format.
    # perl -ne '$|=1; print "[" . time . "]" . ": $_"'

    adb shell 'getevent /dev/input/event4' \
        | grep --line-buffered "0003 0019" \
        | perl -ne '$|=1; print "[" . time . "]" . ": $_"'

    # relative time, the start of recording is the time zero.
    adb logcat | perl -ne \
        '$|=1; $start = time unless $start; print "[" . (time - $start) . "]" . ": $_"'
  #+END_SRC
* Swap file
- use file as swap space.
  #+BEGIN_SRC shell-script
    # create a 4G swap image
    dd if=/dev/zero of=swap.img bs=1024M count=4
    mkswap swap.img

    # see the currently used swap space
    swapon -s

    # mount this file as swap space
    swapon swap.img
  #+END_SRC
  Optionally you can use =swapoff= to disable some swap space.

- add this entry into =/etc/fstab=
  #+BEGIN_SRC conf-space
    /opt/swap.img  none            swap    defaults        0       0
  #+END_SRC
* NTP
** References
- technical presentation
  [[../core/d3/f0/NTP Clock Discipline Modelling and Analysis - presentation.algor.pdf][NTP Clock Discipline Modelling and Analysis - presentation.algor.pdf]]
- Wiki Article
  [[../core/38/eb/Network Time Protocol - Wikipedia, the free encyclopedia.maff][Network Time Protocol - Wikipedia, the free encyclopedia.maff]]
* tar + 7z
How to backup linux files with 7z
: tar cf - <dir/file> | 7z a -si <path_to_archive_file>
* Cool one-line find
- Finding number of files in a folder
  : find . -type f | wc -l

- Finding # of all subfolders with a folder
  : find . -type d | wc -l

- Find # of folders ONLY in current folder
  : find . -maxdepth 1 -type d | wc -l

* Cron/Time Management
A thorough article about almost every practical facets of cron and other time
management in Linux.
[[http://www.markus-gattol.name/ws/time.html][Original link]]

Archived [[../core/e2/0b/Time - Create, Read, Store, Manipulate.maff][Time - Create, Read, Store, Manipulate.maff]]
* Tmux
Tmux is a very versatile terminal multiplexer.

- Good guide

  Interesting short book, most from author's personal experience rather than
  being thorough. Complement the long tmux manual.

  [[../core/76/66/tmux Productive Mouse-Free Development.pdf][tmux Productive Mouse-Free Development.pdf]]
* Fedora/SuSe
** Build packages from Sources RPM
You need to install =rpmbuild=.

=rpmbuild –rebuild package_name.src.rpm=

=rpm -Uvih your_rpm_package.rpm=

Optionally, =SuSEconfig=
** Unpacking/Extracting source rpm
=rpm2cpio foo-1.0-1.src.rpm | cpio --extract --make-directories --verbose=
* Restore/Undeleted deleted/overwritten files
** =testdisk=
This is a tool mainly for partition fixing, however, the built-in file restoring
function has come to handy a lot of times.

Particularly good for case: you know the position of the file and there is no
same-named file under the same path (i.e. doesn't work for overwritten files).
This tool recovers the file by looking at the file system journal.

** =photorec=
The more powerful tool coming from the same developer team. This tool bypasses
the file system, recovers files by looking at the content instead. This is the
best shot for overwritten files.

*NOTE*: Many on web says that you can't recover overwritten files. The fact is
if the blocks of the files are overwritten then you are out of luck, but for
files, usually overwriting leaves the old one intact by storing new content in
new blocks.

** Other "bizarre" ways

=grep=, =debugfs= and blablabla.... They work by principle and look awesome, BUT
it's hard to use them.
