_wiki/2015-07-17-linux-system-configuration-general.html

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">diff + patch</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1">two files both added some lines, but no change among common lines</h3>
<div class="outline-text-3" id="text-6-1">
<p>
example:
</p>

<p>
<code>diff -Naur index/ ~/icwiki/index/ &gt; icwiki-patch.diff</code>
</p>

<p>
<code>patch -Rp0 --merge &lt; ~/learnspace/git-mylife/icwiki/icwiki-patch.diff</code>
</p>

<p>
NOTE: you can &#x2013;dry-run for previous command to see what the effect might be,
however, you are still encouraged to backup your to-be-patched files.
</p>
</div>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">mount virtual disk</h2>
<div class="outline-text-2" id="text-7">
<p>
original reference: <a href="../core/7f/37/How to mount a VirtualBox VDI image | Be the signal.maff">How to mount a VirtualBox VDI image | Be the signal</a>
</p>

<p>
The following the essential steps needed
</p>
<div class="org-src-container">

<pre class="src src-shell-script"># you need to be root
## max_part is needed, as sometimes it defaults to 0
modprobe nbd max_part=16

# nbd0 is established by last cmd
qemu-nbd -c /dev/nbd0 .VirtualBox/Machines/win_xp/LargeData.vdi

mount /dev/mbd0p1 /mnt/tmp
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8">Multiple Pipes</h2>
<div class="outline-text-2" id="text-8">
</div><div id="outline-container-sec-8-1" class="outline-3">
<h3 id="sec-8-1">Common Grep Buffer Issue</h3>
<div class="outline-text-3" id="text-8-1">
<p>
use <code>--line-buffered</code>, a GNU grep extension.
</p>

<ul class="org-ul">
<li>example
<code>adb shell 'getevent /dev/input/event4' | grep --line-buffered "0003 0019" | tee tmp.txt</code>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-8-2" class="outline-3">
<h3 id="sec-8-2">Other Stdout Buffer Issue</h3>
<div class="outline-text-3" id="text-8-2">
<p>
use complex while-read-line structure.
</p>

<ul class="org-ul">
<li>example
<code>tail -f logfile | while read line ; do echo "$line"| grep 'org.springframework'|cut -c 25- ; done</code>
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9">Timestamp output</h2>
<div class="outline-text-2" id="text-9">
<p>
usually we want to timestamp the output, use Perl to do this.
</p>

<p>
<b>NOTE</b>: you may need to deal with buffer issues, refer to <a href="#sec-8">Multiple Pipes</a>.
</p>
<ul class="org-ul">
<li>example
The following timestamp the distance sensor's output.

<div class="org-src-container">

<pre class="src src-shell-script"># This this the one line perl to timestamp the output.
# You can change `time' to `localtime', if you want pretty time format.
# perl -ne '$|=1; print "[" . time . "]" . ": $_"'

adb shell 'getevent /dev/input/event4' \
    | grep --line-buffered "0003 0019" \
    | perl -ne '$|=1; print "[" . time . "]" . ": $_"'

# relative time, the start of recording is the time zero.
adb logcat | perl -ne \
    '$|=1; $start = time unless $start; print "[" . (time - $start) . "]" . ": $_"'
</pre>
</div>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10">Swap file</h2>
<div class="outline-text-2" id="text-10">
<ul class="org-ul">
<li>use file as swap space.
<div class="org-src-container">

<pre class="src src-shell-script"># create a 4G swap image
dd if=/dev/zero of=swap.img bs=1024M count=4
mkswap swap.img

# see the currently used swap space
swapon -s

# mount this file as swap space
swapon swap.img
</pre>
</div>
<p>
Optionally you can use <code>swapoff</code> to disable some swap space.
</p>
</li>

<li>add this entry into <code>/etc/fstab</code>
<div class="org-src-container">

<pre class="src src-conf-space">/opt/swap.img  none            swap    defaults        0       0
</pre>
</div>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11">NTP</h2>
<div class="outline-text-2" id="text-11">
</div><div id="outline-container-sec-11-1" class="outline-3">
<h3 id="sec-11-1">References</h3>
<div class="outline-text-3" id="text-11-1">
<ul class="org-ul">
<li>technical presentation
<a href="../core/d3/f0/NTP Clock Discipline Modelling and Analysis - presentation.algor.pdf">NTP Clock Discipline Modelling and Analysis - presentation.algor.pdf</a>
</li>
<li>Wiki Article
<a href="../core/38/eb/Network Time Protocol - Wikipedia, the free encyclopedia.maff">Network Time Protocol - Wikipedia, the free encyclopedia.maff</a>
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12">tar + 7z</h2>
<div class="outline-text-2" id="text-12">
<p>
How to backup linux files with 7z
</p>
<pre class="example">
tar cf - &lt;dir/file&gt; | 7z a -si &lt;path_to_archive_file&gt;
</pre>
</div>
</div>
<div id="outline-container-sec-13" class="outline-2">
<h2 id="sec-13">Cool one-line find</h2>
<div class="outline-text-2" id="text-13">
<ul class="org-ul">
<li>Finding number of files in a folder
<pre class="example">
find . -type f | wc -l
</pre>
</li>

<li>Finding # of all subfolders with a folder
<pre class="example">
find . -type d | wc -l
</pre>
</li>

<li>Find # of folders ONLY in current folder
<pre class="example">
find . -maxdepth 1 -type d | wc -l
</pre>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-14" class="outline-2">
<h2 id="sec-14">Cron/Time Management</h2>
<div class="outline-text-2" id="text-14">
<p>
A thorough article about almost every practical facets of cron and other time
management in Linux.
<a href="http://www.markus-gattol.name/ws/time.html">Original link</a>
</p>

<p>
Archived <a href="../core/e2/0b/Time - Create, Read, Store, Manipulate.maff">Time - Create, Read, Store, Manipulate.maff</a>
</p>
</div>
</div>
<div id="outline-container-sec-15" class="outline-2">
<h2 id="sec-15">Tmux</h2>
<div class="outline-text-2" id="text-15">
<p>
Tmux is a very versatile terminal multiplexer.
</p>

<ul class="org-ul">
<li>Good guide

<p>
Interesting short book, most from author's personal experience rather than
being thorough. Complement the long tmux manual.
</p>

<p>
<a href="../core/76/66/tmux Productive Mouse-Free Development.pdf">tmux Productive Mouse-Free Development.pdf</a>
</p>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-16" class="outline-2">
<h2 id="sec-16">Fedora/SuSe</h2>
<div class="outline-text-2" id="text-16">
</div><div id="outline-container-sec-16-1" class="outline-3">
<h3 id="sec-16-1">Build packages from Sources RPM</h3>
<div class="outline-text-3" id="text-16-1">
<p>
You need to install <code>rpmbuild</code>.
</p>

<p>
<code>rpmbuild –rebuild package_name.src.rpm</code>
</p>

<p>
<code>rpm -Uvih your_rpm_package.rpm</code>
</p>

<p>
Optionally, <code>SuSEconfig</code>
</p>
</div>
</div>
<div id="outline-container-sec-16-2" class="outline-3">
<h3 id="sec-16-2">Unpacking/Extracting source rpm</h3>
<div class="outline-text-3" id="text-16-2">
<p>
<code>rpm2cpio foo-1.0-1.src.rpm | cpio --extract --make-directories --verbose</code>
</p>
</div>
</div>
</div>
<div id="outline-container-sec-17" class="outline-2">
<h2 id="sec-17">Restore/Undeleted deleted/overwritten files</h2>
<div class="outline-text-2" id="text-17">
</div><div id="outline-container-sec-17-1" class="outline-3">
<h3 id="sec-17-1"><code>testdisk</code></h3>
<div class="outline-text-3" id="text-17-1">
<p>
This is a tool mainly for partition fixing, however, the built-in file restoring
function has come to handy a lot of times.
</p>

<p>
Particularly good for case: you know the position of the file and there is no
same-named file under the same path (i.e. doesn't work for overwritten files).
This tool recovers the file by looking at the file system journal.
</p>
</div>
</div>

<div id="outline-container-sec-17-2" class="outline-3">
<h3 id="sec-17-2"><code>photorec</code></h3>
<div class="outline-text-3" id="text-17-2">
<p>
The more powerful tool coming from the same developer team. This tool bypasses
the file system, recovers files by looking at the content instead. This is the
best shot for overwritten files.
</p>

<p>
<b>NOTE</b>: Many on web says that you can't recover overwritten files. The fact is
if the blocks of the files are overwritten then you are out of luck, but for
files, usually overwriting leaves the old one intact by storing new content in
new blocks.
</p>
</div>
</div>

<div id="outline-container-sec-17-3" class="outline-3">
<h3 id="sec-17-3">Other "bizarre" ways</h3>
<div class="outline-text-3" id="text-17-3">
<p>
<code>grep</code>, <code>debugfs</code> and blablabla&#x2026;. They work by principle and look awesome, BUT
it's hard to use them.
</p>
</div>
</div>
</div>
