_wiki/2015-07-17-linux-system-configuration-general.html
<div id="outline-container-sec-18" class="outline-2">
<h2 id="sec-18">Debug offlineimap error</h2>
<div class="outline-text-2" id="text-18">
<p>
In my workplace, <code>offlineimap</code> fails to retrieve mails from the company mail
sever sometimes.
</p>

<p>
With the following error:
</p>
<div class="org-src-container">

<pre class="src src-text">Folder INBOX [acc: cxiongsuse]:
 Copy message 13095 (1 of 84) cxiongsuse_remote:INBOX -&gt; cxiongsuse_local
 Copy message 13096 (2 of 84) cxiongsuse_remote:INBOX -&gt; cxiongsuse_local
Copy message from cxiongsuse_remote:INBOX:
 Establishing connection to imap.novell.com:993
 ERROR: command: UID =&gt; no response after 60.0 secs
 Establishing connection to imap.novell.com:993
 ERROR: command: UID =&gt; no response after 60.0 secs
 ERROR: command: UID =&gt; no response after 60.0 secs
Folder INBOX [acc: cxiongsuse]:
 Copy message 13097 (3 of 84) cxiongsuse_remote:INBOX -&gt; cxiongsuse_local
Thread 'Copy message from cxiongsuse_remote:INBOX' terminated with exception:
Traceback (most recent call last):
  File "/usr/lib/python2.7/site-packages/offlineimap/threadutil.py", line 156, in run
    Thread.run(self)
  File "/usr/lib64/python2.7/threading.py", line 504, in run
    self.__target(*self.__args, **self.__kwargs)
  File "/usr/lib/python2.7/site-packages/offlineimap/folder/Base.py", line 330, in copymessageto
    message = self.getmessage(uid)
  File "/usr/lib/python2.7/site-packages/offlineimap/folder/IMAP.py", line 225, in getmessage
    raise e
abort: command: UID =&gt; no response after 60.0 secs


Last 3 debug messages logged for Copy message from cxiongsuse_remote:INBOX prior to exception:
thread: Register new thread 'Copy message from cxiongsuse_remote:INBOX' (account 'cxiongsuse')
imap: Attempting plain authentication
imap: Attempting plain authentication
ERROR: Exceptions occurred during the run!
ERROR: command: UID =&gt; no response after 60.0 secs
ERROR: command: UID =&gt; no response after 60.0 secs
ERROR: command: UID =&gt; no response after 60.0 secs
</pre>
</div>

<p>
This article tries to explain a way to "fix" this, well not really a fix but a workaround.
</p>

<ol class="org-ol">
<li>The "Copy" lines before errors identify the possible error message.
</li>

<li>Find the last successfully archived mail

<p>
In the case above, 13095 and 13096 are the suspicious mails ID. Search the
local <code>offlineimap</code> mailbox for these two IDs. If you can't find it, use
13094, i.e. an even earlier one. After all, with an error close, the writing
operation might simply fail.
</p>
</li>

<li>Find another way to log into your mail account.

<p>
Web UI, another Web clients and etc.
</p>
</li>

<li>Locate the mail you find in step 2.

<p>
Sort all your mail from latest to oldest. And look at the source of the mail
in step 2, use "Date" to locate it. Pay attention to the time zone setting.
Let's denote the mail you found "2R".
</p>
</li>

<li>Remove one or more later mail(s) after "2R".

<p>
This would usually solve the problem. Later on, we might try to find out
what's wrong with the "bad" mails.
</p>
</li>
</ol>
</div>
</div>
